{
  "about_me": "Sobre Mim",
  "education": "Educação",
  "experience": "Experiência",
  "skills": "Competências",
  "about_me_description": "Olá, sou o Tiago Cruz, um rapaz de Vila Real com 21 anos. Sou licenciado em Comunicação e Multimédia pela UTAD, e ao longo do meu percurso académico, descobri a minha paixão, sendo essa o desenvolvimento web.\n\nDesde sempre fui uma pessoa muito ativa e apaixonada por desporto, especialmente futsal. Adorava passar o meu tempo a jogar, seja nos treinos, com os amigos ou em jogos mais informais. No entanto, com o tempo, percebi que o meu interesse por tecnologia e criatividade estava a crescer cada vez mais. Por isso, decidi explorar o mundo da programação um campo que me entusiasmou e que hoje faz parte da minha vida.\n\nA minha abordagem ao desenvolvimento e à criatividade é bastante influenciada pelas minhas experiências de vida, que envolvem momentos com os amigos, muita energia e o gosto de jogar computador e ouvir música.\n\nEstou sempre motivado a crescer, tanto profissionalmente como pessoalmente, e procuro, a cada dia, evoluir em todos os aspetos da minha vida, seja na tecnologia, no desporto ou nas relações pessoais.",
  "education_description": "Licenciatura em Comunicação e Multimédia - UTAD\n\nDurante a minha licenciatura, tive a oportunidade de explorar diversas áreas da comunicação, incluindo o design gráfico, a fotografia, o audiovisual e o desenvolvimento web. Fui constantemente desafiado a pensar criativamente e a encontrar soluções inovadoras para problemas complexos.\n\nApaixonei-me especialmente pela programação web, o que me levou a aprofundar os meus conhecimentos em HTML, CSS, JavaScript e PHP. Ao longo do percurso, percebi a importância da comunicação visual e tive a oportunidade de trabalhar em vários projetos de design, sempre com um foco na experiência do utilizador.\n\nA formação que recebi na UTAD não se limitou às bases teóricas. A universidade proporcionou-me também experiências práticas valiosas, como diversos trabalhos académicos e um estágio curricular, que foram cruciais para o meu crescimento profissional e para a minha preparação para o mercado de trabalho.",
  "experience_description": "Durante o meu estágio curricular, tive a oportunidade de mergulhar mais a fundo em Symfony, um framework que me desafiou a pensar de forma mais técnica e criativa. Foi neste ambiente que desenvolvi uma REST API que suportava dois websites, ambos construídos com React e Tailwind CSS. Um desses websites era um painel de controlo para administradores, e o outro, o site principal. Este projeto foi um ponto de viragem para mim, pois consegui aplicar não só as minhas habilidades em back-end, mas também aprimorar as minhas competências em front-end, compreendendo melhor como as tecnologias se integram e funcionam em conjunto.\n\nDurante a minha formação académica, tive a chance de trabalhar em vários projetos, tanto sozinho como em equipa. Um dos que mais me marcou foi o desenvolvimento do meu portfólio pessoal, que fiz em React. Nesse projeto, consegui mostrar o que aprendi até agora e explorar novas formas de melhorar a experiência do utilizador, ao mesmo tempo em que refinei as minhas capacidades em front-end.\n\nAo longo dos meus estudos, também trabalhei em três projetos académicos que me deram uma visão muito prática do processo de desenvolvimento. Um desses projetos foi em PHP, e os outros dois foram desenvolvidos com Laravel e Blade. Cada um destes projetos ajudou-me a aprofundar os meus conhecimentos em diferentes tecnologias e frameworks, além de me dar a oportunidade de compreender melhor como construir aplicações web completas, desde a conceção até à implementação.\n\nEmbora esteja apenas a começar a minha carreira, estou sempre em busca de novos desafios. Quero continuar a crescer, a aprender e a expandir as minhas competências, para poder contribuir cada vez mais para soluções inovadoras e de qualidade.",
  "skills_description": "Aqui estão algumas das minhas competências técnicas organizadas por categorias:",
  "languages": "Linguagens",
  "languages_description": "Conhecimentos em diversas linguagens de programação:",
  "frameworks": "Frameworks",
  "frameworks_description": "Frameworks que utilizo para construir soluções web poderosas:",
  "other_skills": "Outras Competências",
  "other_skills_description": "Outras habilidades que são essenciais no meu trabalho:"
}
